# Occupation

### Import the necessary libraries

In [1]:
import pandas as pd

###  Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Assign it to a variable called users.

In [2]:
address = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
users = pd.read_csv(address, delimiter="|")
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Discover what is the mean age per occupation

In [3]:
users.groupby("occupation")["age"].agg(mean_age = ("mean"))

                mean_age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

###  For each occupation, calculate the minimum and maximum ages

In [4]:
users.groupby("occupation", as_index=False).agg(min_age = ("age","min"), max_age=("age","max")).head()

      occupation  min_age  max_age
0  administrator       21       70
1         artist       19       48
2         doctor       28       64
3       educator       23       63
4       engineer       22       70

### For each combination of occupation and gender, calculate the mean age and sort by age

In [5]:
users.groupby(["occupation", "gender"], as_index=False).age.mean().sort_values(by="age", ascending=False).head()

    occupation gender        age
29     retired      F  70.000000
30     retired      M  62.538462
14  healthcare      M  45.400000
11   executive      F  44.000000
4       doctor      M  43.571429

### For each combination of occupation and gender, calculate the minimum age and count with changed column name as min_age and count

In [6]:
users.groupby(["occupation","gender"], as_index=False).agg(min_age = ("age","min"), count = ("gender","count")).head()

      occupation gender  min_age  count
0  administrator      F       22     36
1  administrator      M       21     43
2         artist      F       19     13
3         artist      M       20     15
4         doctor      M       28      7

### Discover the Male ratio per occupation and sort it from the most to the least

In [7]:
def gender_to_numeric(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0

users['gender_n'] = users['gender'].apply(gender_to_numeric)
a = users.groupby('occupation').gender_n.sum() / users.occupation.value_counts() * 100 
a.sort_values(ascending = False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

### For each occupation present the percentage of women and men

In [8]:
occup_count = users.groupby(["occupation"]).agg({'gender': 'count'})
gender_ocup = users.groupby(['occupation', 'gender']).agg({'gender': 'count'})
occup_gender = gender_ocup.div(occup_count, level = "occupation") * 100
occup_gender.head()

                          gender
occupation    gender
administrator F        45.569620
              M        54.430380
artist        F        46.428571
              M        53.571429
doctor        M       100.000000

### For each occupation and gender the top three youngest age.

In [9]:
def top_three (df):
    return df.nsmallest(3, "age")

In [10]:
users.groupby(["occupation", "gender"]).apply(top_three).age

occupation     gender
administrator  F       179    22
                       438    23
                       725    25
               M       117    21
                       281    22
                              ..
writer         F       619    18
                       616    27
               M       49     21
                       444    21
                       800    22
Name: age, Length: 114, dtype: int64

In [11]:
users.groupby(["occupation", "gender"])["age"].nsmallest(3)

occupation     gender
administrator  F       179    22
                       438    23
                       725    25
               M       117    21
                       281    22
                              ..
writer         F       619    18
                       616    27
               M       49     21
                       444    21
                       800    22
Name: age, Length: 114, dtype: int64

## For each occupation and gender the listed third age person

In [30]:
users.groupby(["occupation", "gender"])["age"].nth(3)

occupation     gender
administrator  F         39
               M         45
artist         F         48
               M         25
doctor         M         51
educator       F         48
               M         32
engineer       M         36
entertainment  M         32
executive      M         48
healthcare     F         48
               M         62
homemaker      F         35
lawyer         M         47
librarian      F         40
               M         37
marketing      F         35
               M         55
none           F         30
               M         11
other          F         28
               M         51
programmer     F         29
               M         26
retired        M         65
salesman       M         23
scientist      M         39
student        F         18
               M         23
technician     M         30
writer         F         44
               M         32
Name: age, dtype: int64

In [31]:
users.groupby(["occupation", "gender"]).ngroups

41